var category=["Для начинающих", "Средний уровень",  "Профи"];
var books=[
			{
				classname:"Для начинающих",
				name:"JavaScript for Web Designers",
				image:"JavaScript for Web Designers.jpeg",
				description:"В книге доступно рассматриваются основы JavaScript. В целом ориентирована на начинающих."
			},
			{
				classname:"Для начинающих",
				name:"Э. Браун – Изучаем JavaScript. Руководство по созданию современных веб-сайтов",
				image:"braun.jpeg",
				description:"Это издание познакомит вас с правилами, спецификациями и инструментальными методами, используемыми в ES6, опираясь на практическую основу, а также научит создавать эффективные приложения на клиентской стороне и в Node.js."
			},
			{
				classname:"Для начинающих",
				name:"К. Дуглас – Как устроен JavaScript",
				image:"duglas.jpeg",
				description:"Весьма оригинальная книга для книжной JavaScript-арены. Субъективный взгляд на то, как работать с этим языком от одного из самых продвинутых его знатоков. JS хорош тем, что на нем можно писать в очень разных стилях, есть множество подходов, которые работают тут, в отличие от более узконаправленных языков. И Дуглас Крокфорд рассказывает о своём видении языка и работы с ним, без особой любви к JS и сюсюканья с ним, но довольно субъективно, тем не менее. Приводит много своих личных «трюков», которые мне понравились, многое не знал, хотя пишу веб-приложения довольно давно."
			},
			{
				classname:"Средний уровень",
				name:"М. Хавербеке – Выразительный JavaScript. Современное веб-программирование",
				image:"js.jpeg",
				description:"Книга для начинающих специалистов, которая поможет погрузиться в JavaScript и начать создавать продукт. Среди базовых синтаксических вещей вам встретятся стрелочные и асинхронные функции, итераторы, шаблонные строки и область видимости. Будут полезны практический опыт автора, множество примеров и обучающие проекты. С повышением сложности будут появляться более интересные темы: управляющие структуры, структуры данных, обработка ошибок и исправление багов, модульность и асинхронное программирование."
			},
			{
				classname:"Средний уровень",
				name:"С. Стефанов – JavaScript. Шаблоны",
				image:"shablony.jpeg",
				description:"Применение шаблонов в JS во многом похоже на другие языки программирования, но имеет свои особенности. Информация в этой книге подкрепляется понятными примерами из реальной жизни, которые помогут лучше уяснить методы решения распространённых задач."
			},
			{
				classname:"Средний уровень",
				name:"Резиг, Бибо, Марас – Секреты JavaScript ниндзя",
				image:"nindzja.jpeg",
				description:"Это переработаннще издание, в котором были внесены дополнительные сведения по следующим темам: функции, замыкания, объекты, прототипы и промисы. Вы изучите: DOM, события и таймеры, передовые практики программирования, тестирование и кросс-браузерный код."
			},
			{
				classname:"Профи",
				name:"Н. Закас – JavaScript. Оптимизация производительности",
				image:"zakas.jpeg",
				description:"Вы освоите ускорение выполнения загрузки, методы манипулирования с DOM, правильную работу со страницей и массу другой полезной информации."
			},
			{
				classname:"Профи",
				name:"Л. Атенсио – Функциональное программирование на JavaScript",
				image:"atensio.jpeg",
				description:"Автор подробно разбирает способы улучшения приложений, расширения и увеличения производительности. Вы научитесь понимать разницу между императивным, объектно-ориентированным и функциональным подходами к программированию на практических примерах."
			},
			{
				classname:"Профи",
				name:"М. Фаулер – Рефакторинг кода на JavaScript",
				image:"refactoring.jpeg",
				description:"Без качественного рефакторинга сложно себе представить работоспособный и растущий проект. В этом труде описано более 50 способов отрефакторить код с практическими примерами. Работы Мартина Фаулера пользуется популярностью и данная книга не исключение."
			}
			];